tutorials/old/movingMeshRhoPimpleDyMFoam_roundHole/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
7794
(
(2147.07 0 0)
(1672.27 0 0)
(8.13648 0 0)
(8.0235 0 0)
(8.13648 0 0)
(8.0235 0 0)
(1801.11 0 0)
(2459.83 0 0)
...
)
;

boundaryField
{
    sides
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    top
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    bottom
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    ring
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
